/*
scsi opr
*/
//====================================================================
// uses
#include	<GrLnxApp.h>

#ifdef	LINUX_APP
#include	<sys/time.h>
#include	<unistd.h>
#include	<fcntl.h>
#include	<sys/stat.h>
#include	<sys/ioctl.h>
#include	<time.h>
#include	<linux/rtc.h>
#include	<sys/times.h>
#endif
#include 	<string.h>

#include	<GrTypeBase.h>

#include	<GrDumyTool.h>

#include	<Hw/Odd/GrScsiOpr.h>
#include	<Hw/Odd/GrDrvDvd.h>
#include	<Hw/Odd/GrScsiMmc.h>
#include 	<Hw/Odd/GrDrvMmc.h>
#include 	<Hw/Odd/GrModes.h>

//====================================================================
//local const
#define	LOG_TRESH	0		/* (Current) Treshold values	*/
#define	LOG_CUMUL	1		/* (Current) Cumulative values	*/
#define	LOG_DFL_TRESH	2		/* Default Treshold values	*/
#define	LOG_DFL_CUMUL	3		/* Default Cumulatice values	*/

//====================================================================
//local type
__s8	ill_booktype[] = "reserved book type";
__s8	*book_types[] = {
	"DVD-ROM",
	"DVD-RAM",
	"DVD-R",
	"DVD-RW",
	"HD DVD-ROM",
	"HD DVD-RAM",
	"HD DVD-R",
	ill_booktype,
	ill_booktype,
	"DVD+RW",
	"DVD+R",
	ill_booktype,
	ill_booktype,
	"DVD+RW/DL",
	"DVD+R/DL",
	ill_booktype,
};

__s8	res_bvers[] = "reserved book version";
__s8	*R_vers[] = {
	"0.9x",
	"1.0x",
	"1.1x",
	res_bvers,
	"1.9x",
	"2.0x",
	"> 2.0x",
	res_bvers,
	res_bvers,
	res_bvers,
	res_bvers,
	res_bvers,
	res_bvers,
	res_bvers,
	res_bvers,
	res_bvers,
};

__s8	*RW_vers[] = {
	"0.9x",
	"1.0x",
	"1.1x",
	"> 1.1x",
	res_bvers,
	res_bvers,
	res_bvers,
	res_bvers,
	res_bvers,
	res_bvers,
	res_bvers,
	res_bvers,
	res_bvers,
	res_bvers,
	res_bvers,
	res_bvers,
};

__s8	ill_dsize[] = "illegal size";
__s8	*disc_sizes[] = {
	"120mm",
	"80mm",
	ill_dsize,
	ill_dsize,
	ill_dsize,
	ill_dsize,
	ill_dsize,
	ill_dsize,
	ill_dsize,
	ill_dsize,
	ill_dsize,
	ill_dsize,
	ill_dsize,
	ill_dsize,
	ill_dsize,
	ill_dsize,
};

__s8	ill_rate[] = "illegal rate";
__s8	*tr_rates[] = {
	"2.52 MB/s",
	"5.04 MB/s",
	"10.08 MB/s",
	"20.16 MB/s",
	"30.24 MB/s",
	ill_rate,
	ill_rate,
	ill_rate,
	ill_rate,
	ill_rate,
	ill_rate,
	ill_rate,
	ill_rate,
	ill_rate,
	ill_rate,
	"Not specified",
};

__s8	ill_layer[] = "illegal layer type";
__s8	*layer_types[] = {
	"Embossed Data",
	"Recordable Area",
	"Rewritable Area",
	ill_layer,
	ill_layer,
	ill_layer,
	ill_layer,
	ill_layer,
	ill_layer,
	ill_layer,
	ill_layer,
	ill_layer,
	ill_layer,
	ill_layer,
	ill_layer,
	ill_layer,
};

__s8	ill_dens[] = "illegal density";
__s8	*ldensities[] = {
	"0.267 ??bit",
	"0.293 ??bit",
	"0.409-0.435 ??bit",
	"0.280-0.291 ??bit",
	"0.353 ??bit",
	ill_dens,
	ill_dens,
	ill_dens,
	ill_dens,
	ill_dens,
	ill_dens,
	ill_dens,
	ill_dens,
	ill_dens,
	ill_dens,
	ill_dens,
};

__s8	*tdensities[] = {
	"0.74 ??track",
	"0.80 ??track",
	"0.615 ??track",
	"0.40 ??track",
	"0.34 ??track",
	ill_dens,
	ill_dens,
	ill_dens,
	ill_dens,
	ill_dens,
	ill_dens,
	ill_dens,
	ill_dens,
	ill_dens,
	ill_dens,
	ill_dens,
};

typedef struct scsi_log_header {	/* Log Page header		*/
	unsigned __s8	p_code	:6;		/* Page code			*/
	unsigned __s8	res	:2;		/* Reserved			*/
	unsigned __s8	res1;			/* Reserved			*/
	unsigned __s8	p_len[2];		/* Page len (n-3)		*/
} scsi_log_hdr;

typedef struct scsi_logp_header {	/* Log Parameter header		*/
	unsigned __s8	p_code[2];		/* Parameter code		*/
	unsigned __s8	lp	:1;		/* List Parameter		*/
	unsigned __s8	res2_1	:1;		/* Reserved			*/
	unsigned __s8	tmc	:2;		/* Treshold met Criteria	*/
	unsigned __s8	etc	:1;		/* Enable Treshold Comarison	*/
	unsigned __s8	tds	:1;		/* Target Save Disable		*/
	unsigned __s8	ds	:1;		/* Disble Save			*/
	unsigned __s8	du	:1;		/* Disable Update		*/
	unsigned __s8	p_len;			/* Parameter len (n-3)		*/
} scsi_logp_hdr;

struct scsi_logpage_0 {
	scsi_log_hdr	hdr;		/* Log Page header		*/
	unsigned __s8		p_code[1];	/* List of supported log pages	*/
};

struct pioneer_logpage_30_0 {
	scsi_logp_hdr	hdr;		/* Log Page header		*/
	unsigned __s8		total_poh[4];	/* Total time powered on (hours)*/
};

struct pioneer_logpage_30_1 {
	scsi_logp_hdr	hdr;		/* Log Page header		*/
	unsigned __s8		laser_poh[4];	/* Total time of laser turned on*/
};

struct pioneer_logpage_30_2 {
	scsi_logp_hdr	hdr;		/* Log Page header		*/
	unsigned __s8		record_poh[4];	/* Total time of recording	*/
};

//adip
typedef struct adip {
	unsigned __s8	cat_vers;		/*  0	*/
	unsigned __s8	disk_size;		/*  1	*/
	unsigned __s8	disk_struct;		/*  2	*/
	unsigned __s8	density;		/*  3	*/
	unsigned __s8	data_zone_alloc[12];	/*  4	*/
	unsigned __s8	mbz_16;			/* 16	*/
	unsigned __s8	res_17[2];		/* 17	*/
	unsigned __s8	man_id[8];		/* 19	*/
	unsigned __s8	media_id[3];		/* 27	*/
	unsigned __s8	prod_revision;		/* 30	*/
	unsigned __s8	adip_numbytes;		/* 31	*/
	unsigned __s8	ref_speed;		/* 32	*/
	unsigned __s8	max_speed;		/* 33	*/
	unsigned __s8	wavelength;		/* 34	*/
	unsigned __s8	norm_write_power;	/* 35	*/
	unsigned __s8	max_read_power_ref;	/* 36	*/
	unsigned __s8	pind_ref;		/* 37	*/
	unsigned __s8	beta_ref;		/* 38	*/
	unsigned __s8	max_read_power_max;	/* 39	*/
	unsigned __s8	pind_max;		/* 40	*/
	unsigned __s8	beta_max;		/* 41	*/
	unsigned __s8	pulse[14];		/* 42	*/
	unsigned __s8	res_56[192];		/* 56	*/
	unsigned __s8	res_controldat[8];	/* 248	*/
} adip_t;

//====================================================================
//local function
__s32		log_sense(St_GrScsiIf *scgp, caddr_t bp, __s32 cnt, __s32 page, __s32 pc, __s32 pp);
BOOL8	has_log_page(St_GrScsiIf *scgp, __s32 page, __s32 pc);
__s32		get_log(St_GrScsiIf *scgp, caddr_t bp, __s32 *lenp, __s32 page, __s32 pc, __s32 pp);
void	print_logpages(St_GrScsiIf *scgp);
void	di_to_dstat(struct disk_info *dip, dstat_t *dsp);

//====================================================================
//var
static long	dvd_next_addr;
extern __s8	*driveropts;
extern __s32 	lverbose;

//====================================================================
//--------------------------------------------------------------------
cdr_t	*identify_dvd(St_GrScsiIf *scgp,	cdr_t *dp )
{
	BOOL8	dvd	 = FALSE;	/* DVD writer	*/
	struct scsi_inquiry*	ip;
	unsigned __s8	mode[0x100];
	struct	cd_mode_page_2A *mp;
	__s32	profile;

	ip	=	&scgp->inq;

